app/controllers/dashboards_controller.rb

  def index
    if current_user.student?
      @list_schools = current_user.schools.student_school.distinct
    elsif current_user.school_admin?
      @school = current_user.own_school
    else
      @list_schools = School.all.includes(:owner)
---
SELECT "schools".* FROM "schools" WHERE "schools"."owner_id" = $1 LIMIT $2  [["owner_id", 45], ["LIMIT", 1]]

  def set_user
    @school_admin = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 47], ["LIMIT", 1]]